from base.skill import Skill
from base.status import Status
from general.recipes import DamageRecipe, CriticalRecipe, CDReductionRecipe, EmptyRecipe


class 驰风八步识破:
    @staticmethod
    def post_cast_effect(self: Skill):
        for _ in range(self.status.stacks["身形"]):
            self.status.skills["识破"].cast()
    
    def __call__(self, status: Status):
        status.skills["驰风八步"].post_cast_effect.append(self.post_cast_effect)
        

RECIPES = {
    "行云式": [
        "行云式(5%伤害)", "行云式(4%伤害)", "行云式(4%会心)", "行云式(3%伤害)",
        "行云式(3%会心)", "行云式(2%会心)"
    ],
    "停云式": [
        "停云式(5%伤害)", "停云式(4%伤害)", "停云式(-2冷却)", "停云式(-1冷却)",
        "停云式(4%会心)", "停云式(3%会心)",
    ],
    "决云式": [
        "决云式(4%伤害)", "决云式(3%伤害)", "决云式(3%会心)", "决云式(2%会心)"
    ],
    "断云式": [
        "断云式(5%伤害)", "断云式(4%伤害)", "断云式(4%会心)", "断云式(3%会心)"
    ],
    "沧浪三叠": [
        "沧浪三叠(5%伤害)", "沧浪三叠(4%伤害)", "沧浪三叠(4%会心)", "沧浪三叠(3%伤害)",
        "沧浪三叠(3%会心)", "沧浪三叠(2%会心)"
    ],
    "横云断浪": [
        "横云断浪(5%伤害)", "横云断浪(4%伤害)", "横云断浪(4%会心)", "横云断浪(3%会心)"
    ],
    "孤锋破浪": [
        "孤锋破浪(5%伤害)", "孤锋破浪(4%伤害)", "孤锋破浪(4%会心)", "孤锋破浪(3%会心)"
    ],
    "留客雨": [
        "留客雨(5%伤害)", "留客雨(4%伤害)", "留客雨(4%会心)", "留客雨(3%伤害)",
        "留客雨(3%会心)", "留客雨(2%会心)"
    ],
    "驰风八步": [
        "驰风八步(-3冷却)", "驰风八步(-2冷却)", "驰风八步(-1冷却)", "驰风八步(识破)"
    ],
    "游风飘踪": [
        "游风飘踪(-8冷却)", "游风飘踪(-7冷却)", "游风飘踪(+3持续)", "游风飘踪(+2持续)"
    ]
}
RECIPE_GAINS = {
    "行云式(5%伤害)": DamageRecipe(["行云式·一", "行云式·二", "行云式·三"], 51 / 1024),
    "行云式(4%伤害)": DamageRecipe(["行云式·一", "行云式·二", "行云式·三"], 41 / 1024),
    "行云式(4%会心)": CriticalRecipe(["行云式·一", "行云式·二", "行云式·三"], 0.04),
    "行云式(3%伤害)": DamageRecipe(["行云式·一", "行云式·二", "行云式·三"], 31 / 1024),
    "行云式(3%会心)": CriticalRecipe(["行云式·一", "行云式·二", "行云式·三"], 0.03),
    "行云式(2%会心)": CriticalRecipe(["行云式·一", "行云式·二", "行云式·三"], 0.02),

    "停云式(5%伤害)": DamageRecipe(["停云式"], 51 / 1024),
    "停云式(4%伤害)": DamageRecipe(["停云式"], 41 / 1024),
    "停云式(4%会心)": CriticalRecipe(["停云式"], 0.04),
    "停云式(3%会心)": CriticalRecipe(["停云式"], 0.03),
    "停云式(-2冷却)": CDReductionRecipe(["停云式"], 32),
    "停云式(-1冷却)": CDReductionRecipe(["停云式"], 16),

    "决云式(4%伤害)": DamageRecipe(["决云式"], 41 / 1024),
    "决云式(3%伤害)": DamageRecipe(["决云式"], 31 / 1024),
    "决云式(3%会心)": CriticalRecipe(["决云式"], 0.03),
    "决云式(2%会心)": CriticalRecipe(["决云式"], 0.02),

    "断云式(5%伤害)": DamageRecipe(["断云式", "断云式-额外"], 51 / 1024),
    "断云式(4%伤害)": DamageRecipe(["断云式", "断云式-额外"], 41 / 1024),
    "断云式(4%会心)": CriticalRecipe(["断云式", "断云式-额外"], 0.04),
    "断云式(3%会心)": CriticalRecipe(["断云式", "断云式-额外"], 0.03),

    "沧浪三叠(5%伤害)": DamageRecipe(["沧浪三叠·一", "沧浪三叠·二", "沧浪三叠·三"], 51 / 1024),
    "沧浪三叠(4%伤害)": DamageRecipe(["沧浪三叠·一", "沧浪三叠·二", "沧浪三叠·三"], 41 / 1024),
    "沧浪三叠(4%会心)": CriticalRecipe(["沧浪三叠·一", "沧浪三叠·二", "沧浪三叠·三"], 0.04),
    "沧浪三叠(3%伤害)": DamageRecipe(["沧浪三叠·一", "沧浪三叠·二", "沧浪三叠·三"], 31 / 1024),
    "沧浪三叠(3%会心)": CriticalRecipe(["沧浪三叠·一", "沧浪三叠·二", "沧浪三叠·三"], 0.03),
    "沧浪三叠(2%会心)": CriticalRecipe(["沧浪三叠·一", "沧浪三叠·二", "沧浪三叠·三"], 0.02),

    "横云断浪(5%伤害)": DamageRecipe(["横云断浪"], 51 / 1024),
    "横云断浪(4%伤害)": DamageRecipe(["横云断浪"], 41 / 1024),
    "横云断浪(4%会心)": CriticalRecipe(["横云断浪"], 0.04),
    "横云断浪(3%会心)": CriticalRecipe(["横云断浪"], 0.03),

    "孤锋破浪(5%伤害)": DamageRecipe(["孤锋破浪"], 51 / 1024),
    "孤锋破浪(4%伤害)": DamageRecipe(["孤锋破浪"], 41 / 1024),
    "孤锋破浪(4%会心)": CriticalRecipe(["孤锋破浪"], 0.04),
    "孤锋破浪(3%会心)": CriticalRecipe(["孤锋破浪"], 0.03),

    "留客雨(5%伤害)": DamageRecipe(["留客雨"], 51 / 1024),
    "留客雨(4%伤害)": DamageRecipe(["留客雨"], 41 / 1024),
    "留客雨(4%会心)": CriticalRecipe(["留客雨"], 0.04),
    "留客雨(3%伤害)": DamageRecipe(["留客雨"], 31 / 1024),
    "留客雨(3%会心)": CriticalRecipe(["留客雨"], 0.03),
    "留客雨(2%会心)": CriticalRecipe(["留客雨"], 0.02),

    "驰风八步(-3冷却)": CDReductionRecipe(["驰风八步"], 48),
    "驰风八步(-2冷却)": CDReductionRecipe(["驰风八步"], 32),
    "驰风八步(-1冷却)": CDReductionRecipe(["驰风八步"], 16),
    "驰风八步(识破)": 驰风八步识破(),

    "游风飘踪(-8冷却)": CDReductionRecipe(["游风飘踪"], 16 * 8),
    "游风飘踪(-7冷却)": CDReductionRecipe(["游风飘踪"], 16 * 7),
    "游风飘踪(+3持续)": EmptyRecipe(),
    "游风飘踪(+2持续)": EmptyRecipe()
}
