from general.recipes import DamageRecipe, CriticalRecipe, CDReductionRecipe, EmptyRecipe

RECIPES = {
    "穿云": [
        "穿云(4%伤害)", "穿云(3%伤害)", "穿云(3%会心)", "穿云(2%会心)", 
        "穿云(-0.5冷却)"
    ],
    "龙吟": [
        "龙吟(5%伤害)", "龙吟(4%伤害)", "龙吟(3%伤害)", "龙吟(-1冷却)"
    ],
    "龙牙": [
        "龙牙(5%伤害)", "龙牙(4%伤害)", "龙牙(4%会心)", "龙牙(3%伤害)",
        "龙牙(3%会心)", "龙牙(2%会心)"
    ],
    "灭": [
        "灭(4%伤害)", "灭(3%伤害)", "灭(3%会心)", "灭(-1冷却)",
        "灭(2%会心)"
    ],
    "突": [
        "突(4%伤害)", "突(3%伤害)", "突(解除锁足)", "突(解除减速)"
    ],
    "断魂刺": [
         "断魂刺(4%伤害)", "断魂刺(3%伤害)", "断魂刺(-1冷却)", "断魂刺(-1冷却)"
    ],
}
RECIPE_GAINS = {
    "穿云(4%伤害)": DamageRecipe(["穿云"], 41 / 1024),
    "穿云(3%伤害)": DamageRecipe(["穿云"], 31 / 1024),
    "穿云(3%会心)": CriticalRecipe(["穿云"], 0.03),
    "穿云(2%会心)": CriticalRecipe(["穿云"], 0.02),
    "穿云(-0.5冷却)": CDReductionRecipe(["穿云"], 8),

    "龙吟(5%伤害)": DamageRecipe(["龙吟"], 51 / 1024),
    "龙吟(4%伤害)": DamageRecipe(["龙吟"], 41 / 1024),
    "龙吟(3%伤害)": DamageRecipe(["龙吟"], 31 / 1024),
    "龙吟(-1冷却)": CDReductionRecipe(["龙吟"], 16),

    "龙牙(5%伤害)": DamageRecipe(["龙牙", "龙牙-龙血"], 51 / 1024),
    "龙牙(4%伤害)": DamageRecipe(["龙牙", "龙牙-龙血"], 41 / 1024),
    "龙牙(4%会心)": CriticalRecipe(["龙牙", "龙牙-龙血"], 0.04),
    "龙牙(3%伤害)": DamageRecipe(["龙牙", "龙牙-龙血"], 31 / 1024),
    "龙牙(3%会心)": CriticalRecipe(["龙牙", "龙牙-龙血"], 0.03),
    "龙牙(2%会心)": CriticalRecipe(["龙牙", "龙牙-龙血"], 0.02),

    "灭(4%伤害)": DamageRecipe(["灭"], 41 / 1024),
    "灭(3%伤害)": DamageRecipe(["灭"], 31 / 1024),
    "灭(3%会心)": CriticalRecipe(["灭"], 0.03),
    "灭(2%会心)": CriticalRecipe(["灭"], 0.02),
    "灭(-1冷却)": CDReductionRecipe(["灭"], 16),

    "突(4%伤害)": DamageRecipe(["突"], 41 / 1024),
    "突(3%伤害)": DamageRecipe(["突"], 31 / 1024),
    "突(解除锁足)": EmptyRecipe(),
    "突(解除减速)": EmptyRecipe(),

    "断魂刺(4%伤害)": DamageRecipe(["断魂刺"], 41 / 1024),
    "断魂刺(3%伤害)": DamageRecipe(["断魂刺"], 31 / 1024),
    "断魂刺(-1冷却)": CDReductionRecipe(["断魂刺"], 16),
}
