from general.recipes import DamageRecipe, CriticalRecipe, EmptyRecipe

RECIPES = {
    "雷走风切": [
        "雷走风切(5%伤害)", "雷走风切(4%伤害)", "雷走风切(4%会心)", "雷走风切(3%伤害)",
        "雷走风切(3%会心)", "雷走风切(2%会心)", "雷走风切(驱散)"
    ],
    "上将军印": [
        "上将军印(4%伤害)", "上将军印(4%会心)", "上将军印(3%伤害)", "上将军印(3%会心)",
        "上将军印(2%伤害)", "上将军印(2%会心)", "上将军印(减伤)"
    ],
    "破釜沉舟": [
        "破釜沉舟(5%伤害)", "破釜沉舟(4%伤害)", "破釜沉舟(4%会心)", "破釜沉舟(3%伤害)",
        "破釜沉舟(3%会心)", "破釜沉舟(2%会心)", "破釜沉舟(距离)"
    ],
    "擒龙六斩": [
        "擒龙六斩(5%伤害)", "擒龙六斩(4%伤害)", "擒龙六斩(4%会心)", "擒龙六斩(9狂意)",
        "擒龙六斩(3%伤害)", "擒龙六斩(3%会心)", "擒龙六斩(2%会心)"
    ],
    "刀啸风吟": [
        "刀啸风吟(5%伤害)", "刀啸风吟(4%伤害)", "刀啸风吟(4%会心)", "刀啸风吟(3%会心)",
        "刀啸风吟(2%会心)", "刀啸风吟(刀气)"
    ],
}
RECIPE_GAINS = {
    "雷走风切(5%伤害)": DamageRecipe(["雷走风切"], 51 / 1024),
    "雷走风切(4%伤害)": DamageRecipe(["雷走风切"], 41 / 1024),
    "雷走风切(4%会心)": CriticalRecipe(["雷走风切"], 0.04),
    "雷走风切(3%伤害)": DamageRecipe(["雷走风切"], 31 / 1024),
    "雷走风切(3%会心)": CriticalRecipe(["雷走风切"], 0.03),
    "雷走风切(2%会心)": CriticalRecipe(["雷走风切"], 0.02),
    "雷走风切(驱散)": EmptyRecipe(),

    "上将军印(4%伤害)": DamageRecipe(["上将军印"], 41 / 1024),
    "上将军印(4%会心)": CriticalRecipe(["上将军印"], 0.04),
    "上将军印(3%伤害)": DamageRecipe(["上将军印"], 31 / 1024),
    "上将军印(3%会心)": CriticalRecipe(["上将军印"], 0.03),
    "上将军印(2%伤害)": DamageRecipe(["上将军印"], 21 / 1024),
    "上将军印(2%会心)": CriticalRecipe(["上将军印"], 0.02),
    "上将军印(减伤)": EmptyRecipe(),

    "破釜沉舟(5%伤害)": DamageRecipe(["破釜沉舟"], 51 / 1024),
    "破釜沉舟(4%伤害)": DamageRecipe(["破釜沉舟"], 41 / 1024),
    "破釜沉舟(4%会心)": CriticalRecipe(["破釜沉舟"], 0.04),
    "破釜沉舟(3%伤害)": DamageRecipe(["破釜沉舟"], 31 / 1024),
    "破釜沉舟(3%会心)": CriticalRecipe(["破釜沉舟"], 0.03),
    "破釜沉舟(2%会心)": CriticalRecipe(["破釜沉舟"], 0.02),
    "破釜沉舟(距离)": EmptyRecipe(),

    "擒龙六斩(5%伤害)": DamageRecipe(["惊燕式", "逐鹰式"], 51 / 1024),
    "擒龙六斩(4%伤害)": DamageRecipe(["惊燕式", "逐鹰式"], 41 / 1024),
    "擒龙六斩(4%会心)": CriticalRecipe(["惊燕式", "逐鹰式"], 0.04),
    "擒龙六斩(9狂意)": EmptyRecipe(),
    "擒龙六斩(3%伤害)": DamageRecipe(["惊燕式", "逐鹰式"], 31 / 1024),
    "擒龙六斩(3%会心)": CriticalRecipe(["惊燕式", "逐鹰式"], 0.03),
    "擒龙六斩(2%会心)": CriticalRecipe(["惊燕式", "逐鹰式"], 0.02),

    "刀啸风吟(5%伤害)": DamageRecipe(["刀啸风吟"], 51 / 1024),
    "刀啸风吟(4%伤害)": DamageRecipe(["刀啸风吟"], 41 / 1024),
    "刀啸风吟(4%会心)": CriticalRecipe(["刀啸风吟"], 0.04),
    "刀啸风吟(3%会心)": CriticalRecipe(["刀啸风吟"], 0.03),
    "刀啸风吟(2%会心)": CriticalRecipe(["刀啸风吟"], 0.02),
    "刀啸风吟(刀气)": EmptyRecipe(),
}
