from base.skill import Skill
from base.status import Status
from general.recipes import DamageRecipe, CriticalRecipe, CDReductionRecipe, TickIncreaseRecipe, EmptyRecipe


class 回复月灵:
    def __init__(self, skill):
        self.skill = skill

    @staticmethod
    def post_cast_effect(self: Skill):
        self.status.buffs["月灵"].increase(20)

    def __call__(self, status: Status):
        status.skills[self.skill].post_cast_effect.append(self.post_cast_effect)


RECIPES = {
    "赤日轮": [
        "赤日轮(5%伤害)", "赤日轮(4%伤害)", "赤日轮(4%会心)", "赤日轮(3%伤害)",
        "赤日轮(3%会心)",
    ],
    "烈日斩": [
        "烈日斩(10%伤害)", "烈日斩(5%伤害)", "烈日斩(4%伤害)", "烈日斩(4%会心)",
        "烈日斩(3%伤害)", "烈日斩(3%会心)"
    ],
    "生死劫": [
        "生死劫(5%伤害)", "生死劫(4%伤害)", "生死劫(3%伤害)", "生死劫(+1距离)"
    ],
    "净世破魔击": [
        "净世破魔击(5%伤害)", "净世破魔击(5%会心)", "净世破魔击(4%伤害)", "净世破魔击(20月灵)",
        "净世破魔击(4%会心)", "净世破魔击(3%伤害)", "净世破魔击(3%会心)",
    ],
    "幽月轮": [
        "幽月轮(5%会心)", "幽月轮(4%伤害)", "幽月轮(4%会心)", "幽月轮(3%伤害)",
        "幽月轮(3%会心)"
    ],
    "银月斩": [
        "银月斩(5%会心)", "银月斩(4%会心)", "银月斩(3%会心)", "银月斩(+2距离)"
    ],
    "光明相": [
        "光明相(-10冷却)", "光明相(-10冷却)", "光明相(-10冷却)", "光明相(驱散)"
    ],
    "驱夜断愁": [
        "驱夜断愁(5%伤害)", "驱夜断愁(5%会心)", "驱夜断愁(4%伤害)", "驱夜断愁(4%会心)", 
        "驱夜断愁(3%伤害)", "驱夜断愁(3%会心)",
    ],
}

RECIPE_GAINS = {
    "赤日轮(5%伤害)": DamageRecipe(["赤日轮", "赤日轮-外功"], 51 / 1024),
    "赤日轮(4%伤害)": DamageRecipe(["赤日轮", "赤日轮-外功"], 41 / 1024),
    "赤日轮(4%会心)": CriticalRecipe(["赤日轮", "赤日轮-外功"], 0.04),
    "赤日轮(3%伤害)": DamageRecipe(["赤日轮", "赤日轮-外功"], 31 / 1024),
    "赤日轮(3%会心)": CriticalRecipe(["赤日轮", "赤日轮-外功"], 0.03),

    "烈日斩(10%伤害)": DamageRecipe(["烈日斩", "烈日斩-外功"], 102 / 1024),
    "烈日斩(5%伤害)": DamageRecipe(["烈日斩", "烈日斩-外功"], 51 / 1024),
    "烈日斩(4%伤害)": DamageRecipe(["烈日斩", "烈日斩-外功"], 41 / 1024),
    "烈日斩(4%会心)": CriticalRecipe(["烈日斩", "烈日斩-外功"], 0.04),
    "烈日斩(3%伤害)": DamageRecipe(["烈日斩", "烈日斩-外功"], 31 / 1024),
    "烈日斩(3%会心)": CriticalRecipe(["烈日斩", "烈日斩-外功"], 0.03),

    "生死劫(5%伤害)": DamageRecipe(["生死劫·日", "生死劫·日-外功", "生死劫·月", "生死劫·月-外功"], 51 / 1024),
    "生死劫(4%伤害)": DamageRecipe(["生死劫·日", "生死劫·日-外功", "生死劫·月", "生死劫·月-外功"], 41 / 1024),
    "生死劫(3%伤害)": DamageRecipe(["生死劫·日", "生死劫·日-外功", "生死劫·月", "生死劫·月-外功"], 31 / 1024),
    "生死劫(+1距离)": EmptyRecipe(),

    "净世破魔击(5%伤害)": DamageRecipe(["净世破魔击·日", "净世破魔击·日-外功", "净世破魔击·月", "净世破魔击·月-外功"], 51 / 1024),
    "净世破魔击(5%会心)": CriticalRecipe(["净世破魔击·日", "净世破魔击·日-外功", "净世破魔击·月", "净世破魔击·月-外功"], 0.05),
    "净世破魔击(4%伤害)": DamageRecipe(["净世破魔击·日", "净世破魔击·日-外功", "净世破魔击·月", "净世破魔击·月-外功"], 41 / 1024),
    "净世破魔击(4%会心)": CriticalRecipe(["净世破魔击·日", "净世破魔击·日-外功", "净世破魔击·月", "净世破魔击·月-外功"], 0.04),
    "净世破魔击(3%伤害)": DamageRecipe(["净世破魔击·日", "净世破魔击·日-外功", "净世破魔击·月", "净世破魔击·月-外功"], 31 / 1024),
    "净世破魔击(3%会心)": CriticalRecipe(["净世破魔击·日", "净世破魔击·日-外功", "净世破魔击·月", "净世破魔击·月-外功"], 0.03),
    "净世破魔击(20月灵)": 回复月灵("净世破魔击·月"),

    "幽月轮(5%会心)": CriticalRecipe(["幽月轮", "幽月轮-外功"], 51 / 1024),
    "幽月轮(4%伤害)": DamageRecipe(["幽月轮", "幽月轮-外功"], 41 / 1024),
    "幽月轮(4%会心)": CriticalRecipe(["幽月轮", "幽月轮-外功"], 0.04),
    "幽月轮(3%伤害)": DamageRecipe(["幽月轮", "幽月轮-外功"], 31 / 1024),
    "幽月轮(3%会心)": CriticalRecipe(["幽月轮", "幽月轮-外功"], 0.03),

    "银月斩(5%会心)": CriticalRecipe(["银月斩", "银月斩-外功"], 51 / 1024),
    "银月斩(4%会心)": CriticalRecipe(["银月斩", "银月斩-外功"], 41 / 1024),
    "银月斩(3%会心)": CriticalRecipe(["银月斩", "银月斩-外功"], 31 / 1024),
    "银月斩(+2距离)": EmptyRecipe(),

    "光明相(-10冷却)": CDReductionRecipe(["光明相"], 160),
    "光明相(驱散)": EmptyRecipe(),

    "驱夜断愁(5%伤害)": DamageRecipe(["驱夜断愁", "驱夜断愁-外功"], 51 / 1024),
    "驱夜断愁(5%会心)": CriticalRecipe(["驱夜断愁", "驱夜断愁-外功"], 0.05),
    "驱夜断愁(4%伤害)": DamageRecipe(["驱夜断愁", "驱夜断愁-外功"], 41 / 1024),
    "驱夜断愁(4%会心)": CriticalRecipe(["驱夜断愁", "驱夜断愁-外功"], 0.04),
    "驱夜断愁(3%伤害)": DamageRecipe(["驱夜断愁", "驱夜断愁-外功"], 31 / 1024),
    "驱夜断愁(3%会心)": CriticalRecipe(["驱夜断愁", "驱夜断愁-外功"], 0.03),
}
